In [2]:
import pandas as pd

In [8]:
info = {
    "Name": ["Syed", "Maaz", "Khan"],
    "Age": [20, 22, 23]
}
df = pd.DataFrame(info)
print(df)

   Name  Age
0  Syed   20
1  Maaz   22
2  Khan   23

In [11]:
#Index-Based access
s = pd.Series([1,2,3,4,5])
print(s)
print(type(s))
print(s[0])
print(s[3])

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
1
4

In [15]:
#Label-Based access
s = pd.Series([20, 22, 23, 24], index = ["Syed", "Maaz", "Khan", "Mohd"])
print(s)
print(s["Maaz"])
print(s["Mohd"])
print(s.index)

Syed    20
Maaz    22
Khan    23
Mohd    24
dtype: int64
22
24
Index(['Syed', 'Maaz', 'Khan', 'Mohd'], dtype='object')

In [16]:
#vectorization
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
print(s1 + s2)

# Also remember series are mutable but the size of the series is immutable.

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [33]:
#Dataframe

info = {
    "Name": ["Syed", "Maaz", "Khan"],
    "Age": [20, 22, 24],
    "CGPA": [7.5, 8.5, 9.5]
}
df = pd.DataFrame(info)
print(df, type(df))
df
print(df.index)
print(df.columns)

   Name  Age  CGPA
0  Syed   20   7.5
1  Maaz   22   8.5
2  Khan   24   9.5 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'CGPA'], dtype='object')

In [36]:
#Dataframe
df = pd.DataFrame(
    [
        ["Syed", 20],
        ["Maaz", 22],
        ["Khan", 24]
    ], columns = ["Name", "Age"] #Here we are explicitly naming the columns
)
print(df)

   Name  Age
0  Syed   20
1  Maaz   22
2  Khan   24

In [41]:
#Dataframe in numpy
import numpy as np

np_arr = np.array(
    [
        [1,2,3,4],
        [5,6,7,8]
    ]
)
df = pd.DataFrame(np_arr, columns = ["A", "B", "C", "D"])
print(df)

   A  B  C  D
0  1  2  3  4
1  5  6  7  8

In [47]:
#Reading data from csv file
df = pd.read_csv("pandas_data.csv")
print(df, type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [48]:
#Reading data form json file
df = pd.read_json("pandas_data.json")
print(df, type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [61]:
#Methods in printing the file data
df.head() #prints starting 5 rows
df.head(4) #prints as customised
df.tail() #prints ending 5 rows
df.tail(3) #prints as customised
df.sample() #prints random row
df.sample(5) #prints as customised
df.info() #prints the info of file
df.shape  #prints the shape(rows and colums)
df.describe #gives the value of numerical data from the file
df.columns
df.nunique()

In [85]:
#assignment 1 
df = pd.read_csv("pandas_assignment_data.csv")
df

In [84]:
#selecting or accessing data

#column data
df["city"]
df [
    ["city",
    "temperature"]
]

#row data
df.loc[0]  
df.loc[0:2] #start idx : end idx (inclusive) GPT
df.iloc[2]
df.iloc[0:2] #start idx : end idx (exclusive) GPT

#individual cells

df.loc[0:2, "city"]  #remember in loc we can directly pass the column name which we want to print
df.columns

df.iloc[0:3, 2]      #but in iloc we need to pass the column index we cant pass the value iloc won't take string as the value

df.at[0, "city"]     # same as loc and iloc but here we can select only one element
df.iat[0, 2]

#Remember all this data being displayed is only a view not a copy.
df= pd.read_csv("pandas_assignment_data.csv").copy() #Better practice everytime before starting with your work make a copy so that the og data can be changed.
print(df)

In [ ]:
#Filtering of data

#On basis of operators
df[ df["aqi"] > 100 ]
df[ df["aqi"] > 100 & (df["temperature"] > 30) ]
#many more check GPT or try with another methods.

#Filtering of data(Query methods)
df.query("aqi > 100")  #remember you can use variable inside the query using @ and the name of the variable
df.query("aqi > 100 & temperature > 30")

In [5]:
#Assignment 2 

Data cleaning part1
df = pd.read_csv("pandas_assignment2_data.csv")

cleaned_data = df.copy()
df.isnull() #returns true if the value is missing
df.isnull().sum() #gives the sum of all the missing values
df.dropna()  #drops the missing rows
df.dropna(axis = 1) # drops the missing col
df.fillna(0) #fills the missing values with 0 or (pass any other values which you want to fill)
cleaned_data["age"] = cleaned_data["age"].fillna(20) #only in the specific label
df.ffill() #fills the empty element with the same element as before(runs forward)
df.bfill() #fills the empty element with the same element as before(runs backward)

cleaned_data

In [ ]:
#Data cleaning part2

df.duplicated() #Displays the duplicates values in the bool format
df["country"]duplicated() #by using the columns(you can also do it by rows or anyother filteration as well)
df.drop_duplicates() #drops duplicates

In [103]:
# Data types

#Here we have done type conversion where age was float we changed it to int
df.dtypes
df2 = df.copy()

df2 = df2.fillna(1)
df2["age"] = df2["age"].astype("int64").copy()
df2.dtypes

#conversion to datetime
pd.to_datetime() #This will convert the type to datetime GPT for more info

#string

df["gender"].str.upper()
df["gender"].str.lower()
df["gender"].str.capitalize()
df["name"].str.split(" ")
df["country"].str.contains("india")
#Many more refer doc or GPT

In [106]:
#Data transformation (feature engineering)

#apply()
#Here we have added a new col of tax and assigned the values usong lambda
df2 = df.copy()  #remember here x is income we have assigned on lambda
df2["tax"] = df2["income"].apply(lambda x: "20%" if x >= 50000 else "10%")
df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  20%
1    2      John Doe  29.0     USA     Male  55000.0  20%
2    3    Jane Smith   NaN  Canada   Female  62000.0  20%
3    4          Alex   NaN     USA  Unknown  47000.0  10%
4    5  Maria Garcia  34.0   Spain   Female      NaN  10%
5    6        Li Wei  27.0   China     Male  51000.0  20%
6    7           NaN  45.0   India   Female  73000.0  20%
7    8    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    9    Rachel Lee  29.0     USA   Female  62000.0  20%
9   10   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  11   Emily Davis  31.0     USA      NaN  58000.0  20%

In [110]:
#map()

#(Here we are changing values from Male=M, female=F, unknown=U)
gender_map = {"Male": "M", "Female": "F", "Unknown": "U"}
df2["gender"].map(gender_map)

0       M
1       M
2       F
3       U
4       F
5       M
6       F
7       M
8       F
9       M
10    NaN
Name: gender, dtype: object

In [111]:
#assign()

#(Here we are assigning the new income col hiking 10% increase in the salary)

df2.assign(new_income = df2["income"] * 1.1)

    id          name   age country   gender   income  tax  new_income
0    1      John Doe  29.0     USA     Male  55000.0  20%     60500.0
1    2      John Doe  29.0     USA     Male  55000.0  20%     60500.0
2    3    Jane Smith   NaN  Canada   Female  62000.0  20%     68200.0
3    4          Alex   NaN     USA  Unknown  47000.0  10%     51700.0
4    5  Maria Garcia  34.0   Spain   Female      NaN  10%         NaN
5    6        Li Wei  27.0   China     Male  51000.0  20%     56100.0
6    7           NaN  45.0   India   Female  73000.0  20%     80300.0
7    8    Ahmed Khan  38.0     NaN     Male  68000.0  20%     74800.0
8    9    Rachel Lee  29.0     USA   Female  62000.0  20%     68200.0
9   10   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%     49500.0
10  11   Emily Davis  31.0     USA      NaN  58000.0  20%     63800.0

In [113]:
#replace()

#(Here we are replacing the old value with the new value)

df2["country"].replace("USA", "United States")

0     United States
1     United States
2            Canada
3     United States
4             Spain
5             China
6             India
7               NaN
8     United States
9            Mexico
10    United States
Name: country, dtype: object

In [121]:
#rename()

#Here we are renaming the col

df2.rename(columns = {"income": "Salary"})
df2.rename(index = {1 : "First"})

       id          name   age country   gender   income  tax
0       1      John Doe  29.0     USA     Male  55000.0  20%
First   2      John Doe  29.0     USA     Male  55000.0  20%
2       3    Jane Smith   NaN  Canada   Female  62000.0  20%
3       4          Alex   NaN     USA  Unknown  47000.0  10%
4       5  Maria Garcia  34.0   Spain   Female      NaN  10%
5       6        Li Wei  27.0   China     Male  51000.0  20%
6       7           NaN  45.0   India   Female  73000.0  20%
7       8    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8       9    Rachel Lee  29.0     USA   Female  62000.0  20%
9      10   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10     11   Emily Davis  31.0     USA      NaN  58000.0  20%

In [126]:
#Sort()

df2.sort_values("income")  #ascending
df2.sort_values("income", ascending = False) #decending

df2.sort_index()

df2.reset_index() #If you want you can drop the old index by using drop command

    index  id          name   age country   gender   income  tax
0       0   1      John Doe  29.0     USA     Male  55000.0  20%
1       1   2      John Doe  29.0     USA     Male  55000.0  20%
2       2   3    Jane Smith   NaN  Canada   Female  62000.0  20%
3       3   4          Alex   NaN     USA  Unknown  47000.0  10%
4       4   5  Maria Garcia  34.0   Spain   Female      NaN  10%
5       5   6        Li Wei  27.0   China     Male  51000.0  20%
6       6   7           NaN  45.0   India   Female  73000.0  20%
7       7   8    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8       8   9    Rachel Lee  29.0     USA   Female  62000.0  20%
9       9  10   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10     10  11   Emily Davis  31.0     USA      NaN  58000.0  20%

In [143]:
#Ranking()

df2["rank"] = df2["id"].rank() #Here ranking is done on the basis of id highest id higher rank
df2

#reorder() - reorders based on the value being passed chech GPT

    id          name   age country   gender   income  tax  rank
0    1      John Doe  29.0     USA     Male  55000.0  20%   1.0
1    2      John Doe  29.0     USA     Male  55000.0  20%   2.0
2    3    Jane Smith   NaN  Canada   Female  62000.0  20%   3.0
3    4          Alex   NaN     USA  Unknown  47000.0  10%   4.0
4    5  Maria Garcia  34.0   Spain   Female      NaN  10%   5.0
5    6        Li Wei  27.0   China     Male  51000.0  20%   6.0
6    7           NaN  45.0   India   Female  73000.0  20%   7.0
7    8    Ahmed Khan  38.0     NaN     Male  68000.0  20%   8.0
8    9    Rachel Lee  29.0     USA   Female  62000.0  20%   9.0
9   10   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%  10.0
10  11   Emily Davis  31.0     USA      NaN  58000.0  20%  11.0

In [27]:
#Groupby and aggregate

#Here mean min and max are the aggregate fnx
df.groupby("country")["income"].mean()
df.groupby("country")["income"].min()
df.groupby("country")["income"].max()

#All at once
df.groupby("country")["income"].agg(["mean","min","max"])

            mean      min      max
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  47000.0  62000.0

In [12]:
# Melt and Pivot

df = pd.DataFrame({
    "country": ["USA", "USA", "India", "India"],
    "year": [2020, 2021, 2020, 2021],
    "sales": [100, 120, 90, 110],
    "profit": [20, 25, 18, 22]
})

# Melt - Wide to long
# Here we have melted the data these 4 var names should be same always where (id_vars = the values we want to preserve), (value_vars = the values we want to melt), (var_name = new col name), (value_name = new col values, so for this case sales and profit values will be dumped here)
melted_df = df.melt(
    id_vars=["country","year"],
    value_vars=["sales","profit"],
    var_name="metrics",
    value_name="value"
)

# Pivot - long to wide
# Here we have restored the data from melted to original form it takes 3 vars which should be same (index = this should be unique)
original = melted_df.pivot(
    index=["country", "year"],
    columns="metrics",
    values="value"
)

In [9]:
melted_df

  country  year metrics  value
0     USA  2020   sales    100
1     USA  2021   sales    120
2   India  2020   sales     90
3   India  2021   sales    110
4     USA  2020  profit     20
5     USA  2021  profit     25
6   India  2020  profit     18
7   India  2021  profit     22

In [13]:
original

metrics       profit  sales
country year
India   2020      18     90
        2021      22    110
USA     2020      20    100
        2021      25    120

In [15]:
# Merging and Joining Data

df_customers = pd.DataFrame({
    "customer_id": [1, 2, 3, 4],
    "name": ["Adam", "Bob", "Charlie", "Dave"]
})

df_orders = pd.DataFrame({
    "order_id": [101, 102, 103, 104],
    "customer_id": [2, 1, 4, 5],
    "amount": [250, 120, 300, 180]
})

In [16]:
df_customers

   customer_id     name
0            1     Adam
1            2      Bob
2            3  Charlie
3            4     Dave

In [17]:
df_orders

   order_id  customer_id  amount
0       101            2     250
1       102            1     120
2       103            4     300
3       104            5     180

In [24]:
# Merge - Merging 2 tables and, "on" tells pandas which common column to use (remember the column we are assigning in "on" should be present in both the tables)

pd.merge(df_customers, df_orders, on="customer_id") #inner join

   customer_id  name  order_id  amount
0            1  Adam       102     120
1            2   Bob       101     250
2            4  Dave       103     300

In [22]:
pd.merge(df_customers, df_orders, on="customer_id", how="left") #left join - left table values will be same and right side values will be changed to NAN if the value is empty.

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4     Dave     103.0   300.0

In [23]:
pd.merge(df_customers, df_orders, on="customer_id", how="right") #right join - right side table will be same and left side table values will be changed to NAN if the data is missing(remember in this case left table is customers and right table is orders)

   customer_id  name  order_id  amount
0            2   Bob       101     250
1            1  Adam       102     120
2            4  Dave       103     300
3            5   NaN       104     180

In [25]:
pd.merge(df_customers, df_orders, on="customer_id", how="outer") #outer join - This will merge both the tables and replace NAN where ever the value is empty

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4     Dave     103.0   300.0
4            5      NaN     104.0   180.0